// function order(words) {
//   const wordsArray = words.split(' ');
//   // const legth = wordsArray.length;
//   const newArray = [];
//   // console.log(wordsArray);

//   for (const word of wordsArray) {
//     // console.log(word);
//     const letters = word.split('');
//     // console.log(letters);

//     for (let i = 1; i <= wordsArray.length; i += 1) {
//       if (letters.includes(String(i))) {
//         newArray[i] = word;
//       }
//     }

//     // if (letters.includes('1')) {
//     //   newArray[0] = word;
//     //   // newArray.push(word);
//     // } else if (letters.includes('2')) {
//     //   newArray[1] = word;
//     //   // newArray.push(word);
//     // } else if (letters.includes('3')) {
//     //   newArray[2] = word;
//     //   // newArray.push(word);
//     // } else if (letters.includes('4')) {
//     //   newArray[3] = word;
//     //   // newArray.push(word);
//     // }

//     // // console.log(letters);
//     // for (const letter of letters) {
//     //   for (let i = 1; i <= legth; i += 1) {
//     //     // console.log(letter);
//     //     // console.log(Number(letter));
//     //     // console.log(i);
//     //     if (Number(letter) === i) {
//     //       // console.log(i);
//     //       wordsArray[i - 1] = word;
//     //     }
//     //   }
//     // }
//   }

//   return newArray.join(' ');
//   // return wordsArray.join(' ');
// }

// console.log(order('is2 Thi1s T4est 3a'));
// console.log(order('4of Fo1r pe6ople g3ood th5e the2'));

//=======================РЕШЕНИЕ================================

// function order(words) {
//   const wordsArray = words.split(' ');
//   const newArray = [];

//   for (const word of wordsArray) {
//     const letters = word.split('');

//     for (let i = 1; i <= wordsArray.length; i += 1) {
//       if (letters.includes(String(i))) {
//         newArray[i - 1] = word;
//       }
//     }
//   }

//   return newArray.join(' ');
// }

// console.log(order(''));
// console.log(order('is2 Thi1s T4est 3a'));
// console.log(order('4of Fo1r pe6ople g3ood th5e the2'));

//======================решение с codewars===================

// function order(words) {
//   const wordsArray = words.split(' ');
//   const newArray = [];
//   for (let i = 0; i <= wordsArray.length; i += 1) {
//     for (let j = 0; j < wordsArray.length; j += 1) {
//       if (wordsArray[j].indexOf(i) >= 0) {
//         newArray.push(wordsArray[j]);
//       }
//     }
//   }
//   return newArray.join(' ');
// }

// console.log(order(''));
// console.log(order('is2 Thi1s T4est 3a'));
// console.log(order('4of Fo1r pe6ople g3ood th5e the2'));
//=======================================================

// function index(words) {
//   const wordsToArray = words.split(' ');
//   const array = [];

//   for (let i = 1; i <= wordsToArray.length; i += 1) {
//     for (let j = 0; j < wordsToArray.length; j += 1) {
//       if (wordsToArray[j].indexOf(i) >= 0) {
//         array.push(wordsToArray[j]);
//       }
//     }
//   }

//   return array.join(' ');
// }

// console.log(index('jhgjh5jlkj kjhjh6 dw2d 2d w3ff fe7'));
// console.log(index('is2 Thi1s T4est 3a'));
// console.log(index('4of Fo1r pe6ople g3ood th5e the2'));

//=======================================================
//=======================================================
//=======================================================
//=======================================================
//=======================================================
//=======================================================
//=======================================================
//=======================================================
//=======================================================
//=======================================================
//=======================================================
//=======================================================
//=======================================================
//=======================================================
//=======================================================
//=======================================================
//=======================================================
//=======================================================
//=======================================================
//=======================================================
//=======================================================
//=======================================================
//=======================================================
//=======================================================
//=======================================================
//=======================================================
//=======================================================
//=======================================================
//=======================================================
//=======================================================
//=======================================================
//=======================================================
//=======================================================
//=======================================================
//=======================================================
//=======================================================
//=======================================================
//=======================================================
//=======================================================
//=======================================================
//=======================================================
//=======================================================
//=======================================================
